# Creating Objects

In [1]:
import pandas as pd
import numpy as np

In [2]:
# From list
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
# From dict
data = {"A": 10, "B": 20, "C": 30}
s_dict = pd.Series(data)
s_dict

A    10
B    20
C    30
dtype: int64

In [4]:
# From numpy array
arr = np.array([100, 200, 300])
s_arr = pd.Series(arr)
s_arr

0    100
1    200
2    300
dtype: int64

In [5]:
# From numpy array
arr = np.array([100, 200, 300])
s_arr = pd.Series(arr, index=['x', 'y', 'z'])
s_arr

x    100
y    200
z    300
dtype: int64

In [6]:
# From CSV file
df_csv = pd.read_csv("mycsvfile.csv")  # assuming file exists
df_csv

       Name  age classs grade gender
0    shivam    3   12th     a      f
1     rohit    2    8th     b      m
2    chetan   12    6th     c      m
3   asshish   32    9th     b      m
4     mohit   12   10th     d      m
5   asshmit   12    4th     e      m
6     tahsu    1   12th     a      f
7     priya   23    5th     b      f
8    sweety    4    7th     d      f
9    cheery   35    9th     b      f
10   candy    65    4th     e      f
11    chiku    4    8th     c      m
12    mohit   67    4th     f      m

In [8]:
# From Excel file
import  openpyxl
df_excel = pd.read_excel("Book1.xlsx")
df_excel

      Name  age classs grade gender
0   shivam    3   12th     a      f
1    rohit    2    8th     b      m
2   chetan   12    6th     c      m
3  asshish   32    9th     b      m
4    mohit   12   10th     d      m
5  asshmit   12    4th     e      m

In [11]:
# From JSON
import json
df_json = pd.read_json("students.json")
df_json

   id   name  age            course
0   1  Rahul   21      Data Science
1   2  Priya   22  Machine Learning
2   3   Amit   20   Web Development